# Pandas

In CS5228, we focus on structured data -- in contrast to unstructured data such as text documents, as well as image, video and audio data. Structured data typically comes in form of a matrix with rows representing individual data items and columns the attributes (or features) of a data item. For these kind of table-like data, the [pandas](https://pandas.pydata.org/) package represents a versatile and powerful data analysis tool for Python.

Very simply speaking, pandas manipulate and analysis table-like data similar to using SQL to query a relational database -- but without the "baggage" of actually using a full-fledged database system. You can easily select different data items based on attribute values (selection) focus on certain features (projection), and more sophisticated operations (e.g., Grouping & Aggregation). 

Throughout this notebook, we use the publicly available [Titanic Dataset](https://www.kaggle.com/c/titanic) for the examples.


### Making the Required Imports

In [1]:
import pandas as pd
import numpy as np

## Read Files

The most important concept in pandas is the [`DataFrame`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html) which wraps the table-like data an provides all the methods for manipulating and analyzing the data. A common way to create a DataFrame is via reading a files, e.g., files with comma-separated (CSV) or tab-separated (TSV) values.

The method [`pandas.read_csv()`](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) make this very easy. It is very configurable with a large number of input parameters to fit the structure of the input file. The Titanic Dataset comes as as normal CSV file, so reading to file into a DataFrame is a breeze.

In [4]:
df = pd.read_csv('data/titanic.csv', index_col=False, sep=',')

df.head() # Shows the first 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Basic Insights

### Data Types

When creating a DataFrame from an input file, pandas tries to infer to the data type of each attribute. The information about the attributes' data types are accessible via [`pandas.DataFrame.dtypes`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html). pandas supports a  [`list of data types`](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#basics-dtypes).

In [6]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

An alternative to check the derived data types is to call [`pandas.DataFrame.info`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html) to get a summary of a DataFrame.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

As you notice, many attributes have been assigned the data type `object` which represents text (i.e., strings) or mixed numeric and non-numeric values.

### Basic Statistics

The method [`pandas.DataFrame.describe()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html) provides basic statistics (incl. count, mean, standard deviation, min/max value) for all numerical attributes.

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Note that these information are not necessary meaningful. For example, `PassengerId`, although a number, is a categorical attributes (i.e., just a unique label for each passenger), so calculating the mean does not make sense. Knowing the type of an attribute -- here, type refers to categorical, ordinal, interval or ratio -- requires semantic understanding of the data that pandas if course does not have.

## Selecting Data from a Pandas Dataframe

It is very common that not all the data in a DataFrame is relevant for any subsequent analysis. pandas support a wide range of methods for [indexing and selecting data](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html). In the following, we cover some of the more commonly used methods.

### Selecting a Single Colum

In [9]:
#age = df['Age'] # Same effect
age = df.Age

age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

A single column is [`pandas.Series`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)

In [10]:
print(type(age))

<class 'pandas.core.series.Series'>

The columns of a DataFrame do not have to be names. For example, not every CSV files contains a headliner with the attribute/column names. In this case, the columns can be indexed using their position in the DataFrame, similar Python lists or NumPy arrays. Intenger-based indexing requires [`pandas.DataFrame.iloc`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html).

In [11]:
age = df.iloc[:,5] # Age is the 6th column (the columns a 0-indexed)

age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

### Selecting Multiple Columns

Instead if selecting a single column one can also selecting multiple columns by specifying a list of column names. The return value will be a new DataFrame (i.e., not a Series) containing only the respective columns

In [12]:
df_age_class = df[['Age', 'Pclass']]

df_age_class.head()

    Age  Pclass
0  22.0       3
1  38.0       1
2  26.0       3
3  35.0       1
4  35.0       3

Again one can use `iloc` to achieve the same result which is particularly needed if the columns have no names because the csv file did not come with any header. Since we want to index to columns -- that is, the second dimension of the DataFrame, we need is splicing to cover all indexes of the first dimension -- that is, all the rows in the DataFrame, similar to indexing for NumPy arrays.

In [13]:
df_age_class = df.iloc[:,[5,2]]

df_age_class.head()

    Age  Pclass
0  22.0       3
1  38.0       1
2  26.0       3
3  35.0       1
4  35.0       3

**Sidenote:** The method of selecting multiple attributes can also be used to reorder the columns. Note that in the original data, `Pclass` comes before `Age`, but we switch the order during the selection process.

Instead of specifying all attributes that should form a new DataFrame, there is also the alternative to specify all attributes that should be removed from the DataFrame. This is of course more convenient when a DataFrame contains a larger number of attributes and only a small number of them are not used for the analysis

In [14]:
df_no_age_class = df.drop(columns =['Age', 'Pclass'])

df_no_age_class.head()

,PassengerId,Survived,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,5,0,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S

Again, here is the alternative way using the column indices instead of the names.

In [15]:
dropped_columns = [2, 5]

df_no_age_class = df.drop(columns=df.columns[dropped_columns])

df_no_age_class.head()

,PassengerId,Survived,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,5,0,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S

### Selecting Rows


#### Selecting Rows via Indexing

The most obvious way to select or multiple rows is via indexing. However, the indexing is not quite as intuitive as it is not fully consistent with Python indexing convention. One the one hand, getting, e.g., the first 3 rows works as expected:

In [16]:
df_sample = df[0:3]

df_sample.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

However, trying the obvious way to select a single row will result in an error.

In [17]:
#df[0]

The correct way is again use `iloc` to explicitly specify indexing using integers.

In [18]:
df_sample = df.iloc[[0]]

df_sample.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

Of course, `iloc` also supports splices.

In [19]:
df_sample = df.iloc[0:3]

df_sample.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### Selecting Rows via Boolean Indexing

Much more useful are methods to select rows based on filter conditions, typically by specifying the values of attributes. For example, let's get all minors, i.e., all passengers of age 17 or younger.

In [22]:
df[df.Age < 18].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q

We can of course combine multiple criteria. For example, let's get all first class passangers younger than 18

In [23]:
df[(df.Age < 18) & (df.Pclass == 1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.00,1,0,PC 17758,108.9000,C65,C
329,330,1,1,"Hippach, Miss. Jean Gertrude",female,16.00,0,1,111361,57.9792,B18,C
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S

Using [`isin()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.isin.html#pandas.Series.isin) we can also specify a list of valid values for a attribute. The example below extracts all passengers if age 20, 30, or 40 -- probably not a really meaningful selection but it just for illustration

In [24]:
df[df.Age.isin([20,30,40])].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
79,80,1,3,"Dowdell, Miss. Elizabeth",female,30.0,0,0,364516,12.4750,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.0,0,0,347466,7.8542,NaN,S

pandas also comes with a wider range of boolean methods that allow for indexing and selecting rows based on attribute values. For example, [`pandas.Series.str.contains`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.contains.html) checks if pattern or regex is contained within a string. This can be simple substring patterns...

In [25]:
df[df.Name.str.contains('Miss.')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q

...or arbitrarily complex regex patterns. The example below select all passengers that have book 2 cabins on Level C. Note that this might not the best regex to accomplish this but it works.

In [26]:
df[df.Cabin.str.contains(r'^C[0-9\s]*C[0-9]*$', na=False)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.550,C22 C26,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.550,C22 C26,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.550,C22 C26,S
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.00,1,0,PC 17757,227.525,C62 C64,C

## Querying DataFrames

Selecting rows based on attributes values is already a form of querying a DataFrame -- analog to basic `WHERE` clauses in SQL queries. However, pandas supports more advanced methods that mimic grouping and aggregating similar to SQL queries.

### Basic Aggregation Operations

**Count -- Number of Attribute Values**

In [27]:
df.Age.count()

714

**Minimum and Maximum Value of an Attribute**

In [30]:
df.Age.min()

0.42

In [31]:
df.Age.max()

80.0

Note that this also works for string values since strings can be sorted lexicographically.

**Summing all Attribute Values**

In [32]:
df.Fare.sum()

28693.9493

In [ ]:
#df.Name.sum() # This works as well: summing up strings means concatenating all strings

**Mean and Standard Deviation**

In [33]:
df.Age.mean()

29.69911764705882

In [34]:
df.Age.std()

14.526497332334042

The mean and standard deviation are of course only defined over numerical values and these two methods will throw an error when applied to a string attribute.

Naturally, this aggregation methods can be used in combination with different filter conditions. For example, we can compare the mean ages and the standard deviations for 1st, 2nd, and 3rd class passengers

In [37]:
for c in [1, 2, 3]:
    df_class = df[df.Pclass == c]
    print("Class {}: Mean={:.2f}, StdDev={:.2f}".format(c, df_class.Age.mean(), df_class.Age.std()))

Class 1: Mean=38.23, StdDev=14.80
Class 2: Mean=29.88, StdDev=14.00
Class 3: Mean=25.14, StdDev=12.50

### Grouping & Aggregation

Basic aggregation works across all data samples, and when we want to perform aggregation on subsets, we can use multiple independent aggregation queries as a default solution -- see the example above for calculating the mean and standard deviation for each passenger class. However, this independent queries involve repeating the same processing steps several time. For example, we have to go over the DataFrame above 3 times to extract all passenger of the same class. Particularly for large datasets with many required queries, this can significantly effect the overall performance in a negative way.

But again, pandas got us cover and supports grouping, i.e., the specification of subsets of the data over which aggregation methods applied (similar to `GROUP BY` statements in SQL queries). Using grouping, we can calculate the means an standard deviation for all 3 passenger classes using a single query.

When applying only one aggregation function, the syntax is pretty simple.

In [38]:
df.groupby('Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

When applying multiple aggregation functions over the same groups, the best the most practical approach is via "named aggregation" where you define a name of each resulting aggregation that will form your result DataFrame. Using named aggregation we can get the means and standard deviations using a single query.

In [39]:
df.groupby(['Pclass']).agg(mean_Age=('Age',np.mean), std_Age=('Age',np.std))

         mean_Age    std_Age
Pclass
1       38.233441  14.802856
2       29.877630  14.001077
3       25.140620  12.495398

As one would expect, we can define groups over more than one attribute at a time. Let's extend our example to form groups with respect to the Age as well as whether has survived or not.

In [40]:
df.groupby(['Pclass', 'Survived']).agg(mean_Age=('Age',np.mean), std_Age=('Age',np.std))

                  mean_Age    std_Age
Pclass Survived
1      0         43.695312  15.284243
       1         35.368197  13.760017
2      0         33.544444  12.151581
       1         25.901566  14.837787
3      0         26.555556  12.334882
       1         20.646118  11.995047

## Data Manipulation

Apart from just querying a DataFrame to analyze the data, pandas also provides many methods to manipulate the data as part of preprocessing for subsequent analyses. Data manipulation can refer to changing existing values (e.g., rounding, scaling, normalizing) but also by creating new columns/features, typically derived from existing feature values.

Data preprocessing is a topic of the first lecture, and there will be a dedicated lecture notebook that performs common preprocessing steps using pandas. Hence, we can stop a detailed discussion here.

## Summary

pandas is an excellent tool to analyze data as well as to preprocess data for more sophisticated data analyses such as clustering, regression, classification, association rules, etc. A good grasp of the methods provided by pandas can make life very easy as many queries and preprocessing steps can be implemented using very view lines of codes. Similar to NumPy -- in fact, pandas internally relies in NumPy -- the underlying algorithms are not implemented in Python but in C/C++ making the execution typically much faster compared to the runtime of the same algorithms implemented in native Python.

This notebook and the lecture notebook for Lecture 1 cover only a small subset of the feature set of pandas, and it's worthwhile to check the documentation in case for more specific task when handling your own datasets.